// 동아리 데이터
export const clubData = {
  "학과별_전공동아리": [
    {
      "학과": "정보보호과",
      "영문학과명": "COMPUTER SECURITY",
      "동아리": [
        {
          "이름": "TeamLog",
          "분류": "서버프로그래밍반",
          "설명": "리눅스 서버, 서비스 운영, 네트워크 등을 배우는 서버 프로그래밍 전문 동아리입니다. 서버 프로그래밍, 네트워크, 웹 개발에 관심 있는 학생들이 모여 프론트엔드와 백엔드 기술, 네트워크 분야의 기초부터 실무까지 함께 학습하며, IT 기술 전반에 대한 지식과 경험을 쌓을 수 있는 동아리입니다."
        },
        {
          "이름": "Iris",
          "분류": "인공지능, IoT 연구반",
          "설명": "파이썬, 머신러닝, 딥러닝을 학습하고, 데이터 분석 능력을 키우며, 아두이노와 라즈베리파이, 네트워크에 대해 공부하여 이를 바탕으로 AI와 IoT 관련 프로젝트를 수행하는 동아리입니다."
        },
        {
          "이름": "Layer7",
          "분류": "해커반",
          "설명": "정보보안에 관심 있는 학생들이 모여 구성한 정보보안 전문 동아리로, 다양한 보안 프로젝트를 진행하고 각종 대회에 출전하여 우수한 성과를 거두고 있는 고등학교 최고의 보안 동아리입니다."
        },
        {
          "이름": "UNIFOX",
          "분류": "프로그래밍 동아리",
          "설명": "프로그래밍에 관심 있는 학생들이 모여 알고리즘, 웹, 해킹 등을 공부하며, 보안에 최적화된 개발 역량을 키워가는 프로그래밍 동아리입니다."
        }
      ]
    },
    {
      "학과": "소프트웨어과",
      "영문학과명": "SOFTWARE",
      "동아리": [
        {
          "이름": "TAPIE",
          "분류": "협업 개발연구과",
          "설명": "모바일 애플리케이션 및 웹 서비스를 개발하는 동아리입니다. 주로 Kotlin과 React를 사용하여 모바일 애플리케이션을 개발하며, 팀별 협업을 통해 프로젝트를 진행합니다. 주기적인 발표와 코드 리뷰를 통해 서로의 개발 능력을 향상시키고, 최신의 소프트웨어 개발 및 콘텐츠 개발에 대한 트렌드를 공유합니다. 창의적인 아이디어를 현실로 만들고 싶은 분들, 개발 역량을 키우는 동아리입니다."
        },
        {
          "이름": "C, real",
          "분류": "게임개발팀",
          "설명": "Unity를 활용하여 다양한 플랫폼과 장르의 게임을 개발하는 동아리입니다. 멤버들은 프로그래머와 디자이너로 구성되어 있으며, 협업을 통해 창의적이고 몰입감 있는 게임을 만들어갑니다. 액션, 어드벤처, 퍼즐 등 다양한 장르를 아우르며, PC, 모바일, 콘솔 등 여러 플랫폼에 걸쳐 게임을 개발합니다. 주기적인 프로젝트 발표와 피드백 세션을 통해 역량을 키우는 동아리입니다."
        },
        {
          "이름": "AnA",
          "분류": "서버 개발팀",
          "설명": "서버 기반의 웹서비스 개발 동아리로서 Django, Flask, Node.js웹 프레임 워크를 이용하여 데이터베이스, 서버 운영을 공부하고 이를 통해 웹서비스 개발에 필요한 능력을 함양하는 동아리입니다."
        },
        {
          "이름": "PARA",
          "분류": "인공지능,서비스개발팀",
          "설명": "최신 AI 기술을 연구하고, 실제 서비스에 적용하는 방법을 배우는 동아리입니다. 머신러닝, 딥러닝, 자연어 처리 등 다양한 분야를 탐구하며, 팀 프로젝트를 통해 실질적인 경험을 쌓을 수 있습니다. AI 모델을 구축하고, 데이터를 분석하며, 창의적인 아이디어를 현실로 구현하는 과정에서 협업의 중요성을 배우게 됩니다. 또한, 최신 연구 트렌드와 산업 동향을 파악하며, 미래의 AI 전문가로 성장할 기회를 제공하는 동아리입니다."
        }
      ]
    },
    {
      "학과": "IT경영과",
      "영문학과명": "INFORMATION TECHNOLOGY MANAGEMENT",
      "동아리": [
        {
          "이름": "TAXI",
          "분류": "회계세무반",
          "설명": "TAXI는 주로 회계 관련 자격증, 경제 및 금융관련 지식을 함께 공부하며 회계 실력향상을 목표로 하는 동아리입니다. IT경영과 전공과목 중 하나인 회계원리'가 낯설고 어렵게 느껴질 수 있는 만큼, 수업에서 이해되지 않는 내용이나 배우지 못한 부분을 멘토-멘티 그룹을 통해 서로 돕고 보완합니다. 부원들의 성장을 위한 학습 활동에 중점을 두는 동아리입니다."
        },
        {
          "이름": "BFD",
          "분류": "창업연구반",
          "설명": "IT경영과 대표 동아리로 창업과 관련된 여러 활동들을 진행합니다. 비즈쿨(제품을 직접 제작, 판매하는 활동), 발표 능력 향상, 크라우드 펀딩 대회, 외부 대회 진행 등을 통해 경험과 능력을 쌓는 동아리입니다."
        },
        {
          "이름": "KIWINOMICS",
          "분류": "경영경제연구반",
          "설명": "키위노믹스는 경제와 금융에 대한 지식을 공부하고, 이를 바탕으로 다양한 대회에 참가하며 실전 경험을 쌓는 동아리 입니다. 2학년이 되면, 1학년 때 배운 내용을 신입생들에게 가르 치고 수업을 준비하는 과정을 통해 학습을 심화하는 활동을 하는 동아리입니다."
        },
        {
          "이름": "FRS",
          "분류": "펀드연구반",
          "설명": "FRS는 금융기사 스크랩, 기업 분석, 주식 분석 등의 활동 후 친구들과 공유하며 전망을 예측하는 활동을 진행합니다. 또한 모의투자와 한국거래소 견학을 통해 금융을 깊이 있게 연구하는 동아리입니다."
        },
        {
          "이름": "HMH",
          "분류": "IT융합연구반",
          "설명": "IT관련 다양한 연구를 통해 사업 기획, 웹사이트 구축, 빅데이터 시각화 등의 분야에서 창의적인 IT 실무 능력 증진, 각종 IT 프로젝트 수행 능력을 함양하는 동아리입니다."
        }
      ]
    },
    {
      "학과": "콘텐츠디자인과",
      "영문학과명": "CONTENTS DESIGN",
      "동아리": [
        {
          "이름": "V.Friends",
          "분류": "디자인교육봉사반",
          "설명": "디자인의 즐거움을 여러사람들과 나누며 성장하는 곳으로 3D, 편집디자인, 모션그래픽, 앱디자인 등 다양한 디자인툴을 배우며 공유하는 콘텐츠 디자인과의 디자인 교육봉사 동아리입니다."
        },
        {
          "이름": "FRAME",
          "분류": "실사모션그래픽제작전문반",
          "설명": "자의누리×아우내 리브랜딩 동아리로서 영상 제작을 전문으로 합니다. 에프터 이펙트를 통해 타이포그래피, 모션그래픽을 배울 수 있으며, 실제 사진이나 현실적 비주얼을 구현하면서 움직임을 통해 정보를 전달하거나 시각적 흥미를 유발하는 실사모션그래픽을 교육하고 있습니다."
        },
        {
          "이름": "LAUM",
          "분류": "만화일러스트레이션연구반",
          "설명": "만화와 캐릭터 일러스트 등 여러 그림들을 기초부터 심화까지, 그림에 관심과 열정을 가진 학생들이 모여서 작업하고 배울 수 있는 동아리로 만화, 일러스트에 대한 다양한 활동을 경험할 수 있는 동아리입니다."
        },
        {
          "이름": "TATE",
          "분류": "디자인전문동아리",
          "설명": "포스터, 로고디자인, 편집디자인, 영상 디자인 등 다양한 디자인 분야의 작업물 제작 활동을 하며 디자인 체험활동과 디자인 관련 툴스터디 활동을 통해 디자인지식을 쌓고 미래의 디자인 전문가를 준비하는 동아리입니다."
        }
      ]
    }
  ]
};